Revit 2026 API

# FilterableValueProvider Properties

---

The FilterableValueProvider type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

FilterableValueProvider Class

Autodesk.Revit.DB Namespace